In [3]:
import pandas as pd
import numpy as np

# zadanie 1

In [2]:
my_list = [1, 5, 2, 5]

In [4]:
s = pd.Series(my_list)

In [5]:
s[3]

np.int64(5)

In [9]:
s.index = ['a', 'b', 'c', 'd']
s.name = 'my_series'

In [10]:
s

a    1
b    5
c    2
d    5
Name: my_series, dtype: int64

In [11]:
s['b']

np.int64(5)

In [12]:
s.iloc[1]

np.int64(5)

In [13]:
s.values

array([1, 5, 2, 5])

In [14]:
pd.Series(['a', 45, 45.2])

0       a
1      45
2    45.2
dtype: object

In [16]:
pd.Series(np.array([2, 4,0]))

0    2
1    4
2    0
dtype: int64

In [17]:
my_dict = {'a': 3.3, 'b': 7, 'c': 10.56}

In [18]:
pd.Series(my_dict)

a     3.30
b     7.00
c    10.56
dtype: float64

 # zadanie 2

In [20]:
matrix = np.array([[2, 3, 4], [4, 5, 2], [1, 4, 3]])

In [21]:
matrix

array([[2, 3, 4],
       [4, 5, 2],
       [1, 4, 3]])

In [24]:
df = pd.DataFrame(matrix)

In [25]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [27]:
df.columns = ['koluimna1', 'kolumna2', 'kolumna3']

In [29]:
df.index = ['wiersz1', 'wiersz2', 'wiersz3']

In [30]:
df

         koluimna1  kolumna2  kolumna3
wiersz1          2         3         4
wiersz2          4         5         2
wiersz3          1         4         3

In [33]:
df.loc['wiersz2', 'kolumna2']

np.int64(5)

In [45]:
new_df = df[['kolumna3','kolumna2']]

In [46]:
new_df.loc['wiersz1', 'kolumna2'] = 88

C:\Users\jolech\AppData\Local\Temp\ipykernel_5436\3680604174.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.loc['wiersz1', 'kolumna2'] = 88

In [47]:
new_df

         kolumna3  kolumna2
wiersz1         4        88
wiersz2         2         5
wiersz3         3         4

In [49]:
df

         koluimna1  kolumna2  kolumna3
wiersz1          2         3         4
wiersz2          4         5         2
wiersz3          1         4         3

In [52]:
df.iloc[2, 2]

np.int64(3)

In [55]:
pd.DataFrame(my_dict, index=[0])

     a  b      c
0  3.3  7  10.56

In [59]:
pd.DataFrame({'name': ['ewa', 'magda', 'ala'], 'age': [34, 23, 44]})

    name  age
0    ewa   34
1  magda   23
2    ala   44

In [60]:
from collections import namedtuple

In [61]:
Person = namedtuple('Person', ['name', 'age'])

In [62]:
my_list = [Person('ala', 45), Person('ola', 30)]

In [63]:
pd.DataFrame(my_list)

  name  age
0  ala   45
1  ola   30

In [64]:
from dataclasses import dataclass

In [65]:
@dataclass
class Person2:
    name: str
    age: int

In [66]:
my_list = [Person2('ala', 45), Person2('ola', 30)]

In [68]:
pd.DataFrame(my_list)

  name  age
0  ala   45
1  ola   30

# zadanie 3

In [70]:
names = pd.Series(['ala', 'olo'])
ages = pd.Series([3, 42])

In [71]:
names.name = 'name'

In [72]:
ages.name = 'age'

In [75]:
pd.concat([names, ages], axis=1)

  name  age
0  ala    3
1  olo   42

In [74]:
pd.DataFrame([names, ages])

        0    1
name  ala  olo
age     3   42

# zadanie4

In [7]:
ser1 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [8]:
primes = pd.Series([2, 3, 5, 7])

In [9]:
mask = ser1.isin(primes)

In [10]:
mask

0    False
1     True
2     True
3    False
4     True
5    False
6     True
7    False
8    False
dtype: bool

In [11]:
ser2 = ser1[~mask]

In [12]:
ser2.reset_index(drop = True)

0    1
1    4
2    6
3    8
4    9
dtype: int64

# Zadanie 5

In [13]:
ser11 = pd.Series([1, 2, 3, 10, 11, 12]) 
ser12 = pd.Series([1, 2, 3, -4, -5])

In [14]:
mask1 = ~ser11.isin(ser12)
mask2 = ~ser12.isin(ser11)

In [15]:
pd.concat([ser11[mask1], ser12[mask2]])

3    10
4    11
5    12
3    -4
4    -5
dtype: int64

In [19]:
union = np.union1d(ser11, ser12)
intersect = np.intersect1d(ser11, ser12)

In [21]:
pd.Series(np.setdiff1d(union, intersect))

0    -5
1    -4
2    10
3    11
4    12
dtype: int64

# Zadanie 6

In [8]:
df = pd.read_csv('heights.csv')
df.drop('Unnamed: 0', axis=1, inplace=True)
df.head()

   height  sex
0   175.3    1
1   193.5    1
2   186.5    1
3   187.2    1
4   181.5    1

In [16]:
mask = df['sex'] == 1
males = df['height'][mask]

{'max': max(males), 'min': min(males), 
 '1st quartile': float(np.quantile(males, q = 0.25)),
 '2st quartile': float(np.quantile(males, q = 0.5)),
 '3st quartile': float(np.quantile(males, q = 0.75))}

{'max': 198.1,
 'min': 157.2,
 '1st quartile': 172.85000000000002,
 '2st quartile': 177.8,
 '3st quartile': 182.775}

In [17]:
mask = df['sex'] == 0
females = df['height'][mask]

{'max': max(females), 'min': min(females),  
 '1st quartile': float(np.quantile(females, q = 0.25)),
 '2st quartile': float(np.quantile(females, q = 0.5)),
 '3st quartile': float(np.quantile(females, q = 0.75))}

{'max': 182.9,
 'min': 147.2,
 '1st quartile': 160.0,
 '2st quartile': 164.5,
 '3st quartile': 169.5}

In [21]:
df.quantile([0.25, 0.5, 0.75])

      height  sex
0.25  163.80  0.0
0.50  170.25  0.0
0.75  177.80  1.0

In [22]:
df.describe()

           height         sex
count  506.000000  506.000000
mean   171.138142    0.486166
std      9.415655    0.500303
min    147.200000    0.000000
25%    163.800000    0.000000
50%    170.250000    0.000000
75%    177.800000    1.000000
max    198.100000    1.000000

In [25]:
df.groupby('sex').max()

     height
sex
0     182.9
1     198.1

In [28]:
df.groupby('sex').describe()

    height
     count        mean       std    min     25%    50%      75%    max
sex
0    260.0  164.872308  6.544602  147.2  160.00  164.5  169.500  182.9
1    246.0  177.760569  7.194280  157.2  172.85  177.8  182.775  198.1

In [30]:
df['new'] = np.random.uniform(size=df.shape[0])

In [31]:
df

     height  sex       new
0     175.3    1  0.037175
1     193.5    1  0.770659
2     186.5    1  0.076552
3     187.2    1  0.379800
4     181.5    1  0.336893
..      ...  ...       ...
501   176.5    0  0.531634
502   164.4    0  0.479448
503   160.7    0  0.013409
504   174.0    0  0.874008
505   163.8    0  0.794718

[506 rows x 3 columns]

In [32]:
df.groupby('sex').describe()

    height                                                                new  \
     count        mean       std    min     25%    50%      75%    max  count
sex
0    260.0  164.872308  6.544602  147.2  160.00  164.5  169.500  182.9  260.0
1    246.0  177.760569  7.194280  157.2  172.85  177.8  182.775  198.1  246.0


         mean       std       min       25%       50%       75%       max
sex
0    0.492116  0.293626  0.007018  0.228718  0.500618  0.764825  0.996471
1    0.497445  0.292141  0.002094  0.248215  0.490768  0.758261  0.990782